[
{"name" : "Submission New", "message":"Hi, thanks for starting a listing with us. I am here to help - just ask. When your listing is ready submit for approval. For more info on how to complete your listing see here: https://sdq.st/submit\n https://sdq.st/a/"},
{"name" : "Submission Approval No ", "message":"Hi, thanks for starting a listing with us. I am here to help- just ask. You have submitted for approval however your listing is not ready just yet. Please add a download link. I recommend Github however Dropbox will work if you change the end of the link to dl=1. For more info on how to complete your listing see here: https://sdq.st/submit  Submit for approval when ready.\n https://sdq.st/a/"},
{"name" : "Approval N", "message":"Hi, You have submitted for approval however your listing is not ready just yet. Please add a download link. I recommend Github however Dropbox will work if you change the end of the link to dl=1. Update the link, SAVE and submit for approval when complete. For more info on how to complete your listing see here: https://sdq.st/submit  \n https://sdq.st/a/"},
{"name" : "Submission Approval Y", "message":"Hi, thanks for listing with us.  I am here to help- just ask.  I have pre-approved your app. You are now in control and you can choose to publish, use the Early Access system or share privately using keys. If you plan to publish then tag any hype about your app @sidequestvr on Twitter and we will share. Also use #virtualreality #oculusquest in posts as bots retweet these. Check out our new Promotion system for Homepage Banners and Infill Ads - https://sdq.st/promote  \n https://sdq.st/a/"},
{"name" : "Approval Y", "message":"Hi, I have pre-approved your app. You are now in control and you can choose to publish, use the Early Access system or keep private. \n For more info on how we can help you promote your app visit: https://sidequestvr.atlassian.net/l/c/3QLXTxbV \n To discuss any of these opportunities join the Dev Discord and dm @orlaharris - https://sdq.st/devdiscord  \n https://sdq.st/a/"},
{"name" : "Dropbox DL1", "message":"Hi, One quick note before we can test, please change the end of the Dropbox link to dl=1 to make it a direct download.  Update the link, SAVE and submit for approval when complete. For more info see here: https://sdq.st/submit \n https://sdq.st/a/"},
{"name" : "Dropbox Error", "message":"Hi, Unfortunately your Dropbox link is producing an error. Please check and update the link.  Update the link, SAVE and submit for approval when complete.  For more info see here: https://sdq.st/submit \n https://sdq.st/a/"},
{"name" : "Google Drive", "message":"Hi, thanks for listing with us. Unfortunately we cannot integrate with Google Drive. I recommend Github however Dropbox will work if you change the end of the link to dl=1.  Update the link, SAVE and submit for approval when complete. For more info see here: https://sdq.st/submit \n https://sdq.st/a/"},
{"name" : "Unknown Drive", "message":"Hi, thanks for listing with us. Unfortunately we cannot integrate with the download link you have provided. I recommend Github however Dropbox will work if you change the end of the link to dl=1.  Update the link, SAVE and submit for approval when complete. For more info see here: https://sdq.st/submit \n https://sdq.st/a/"},
{"name" : "Approval Itch N", "message":"Hi, Thanks for listing with us. One quick note, please add the Itch URL under Donate URLS and remove from direct downloads.  Update the link, SAVE and submit for approval when complete.  If this is a paid game please also send a key so I can test the installation. More info here: https://sdq.st/submit \n https://sdq.st/a/"},
{"name" : "Itch Key", "message":"Hi, thanks for listing with us. As this is a paid app can you please share an Itch key and I will test the installation. Thanks."},
{"name" : "Itch Public", "message":"Hi, Quick note, it looks like your Itch page is private. Check these instructions to make your Itch page live: From the project's Edit page on ITCH, scroll to the Visibility & Access section located on the bottom and select the Public option. After saving your page, your project is published. Once you have completed this, submit for approval. Thanks"},
{"name" : "Promote", "message":"Hi, For more info on how we can help you promote your app visit: https://sidequestvr.atlassian.net/l/c/3QLXTxbV \n To discuss any of these opportunities join the Dev Discord and dm @orlaharris - https://sdq.st/devdiscord  \n https://sdq.st/a/ "},
{"name" : "Claim An App", "message":"Hi, thanks for reaching out. In order to prove you are the developer, would you mind sending me an email orla@sidequestvr.com - with a screen shot of the top of your Oculus Dashboard. We just need that to verify then I can transition the app to your account. Thanks!"},   
{"name" : "Unclaimed App User Message", "message":"Hi There, it looks like the Developer has not claimed this listing so they won't receive your messages. Thanks"},   
{"name" : "Broken Link", "message":"Hi, it looks like your link has stopped working / has been removed.  We have temporarily unapproved the listed. Please update the link and submit for approval when ready so we can check and pre-approve. \n https://sdq.st/a/"},
{"name" : "Duplicate App Lab", "message":"Hi There, it looks like someone submitted your App Lab game to Sidequest but you also have an active listing.  We have unapproved the duplicate listing so you can now add your App Lab link to your current listing under the 'integrations tab' in 'Manage'. You can choose to remove your sideload link or keep it. \n For more info on how we can help you promote your app visit: https://sidequestvr.atlassian.net/l/c/3QLXTxbV \n To discuss any of these opportunities join the Dev Discord and dm @orlaharris - https://sdq.st/devdiscord  \n https://sdq.st/a/ "},  
{"name" : "App Transfer Complete", "message":"Hi There, I have now transferred the app to you. You are now in control. \n For more info on how we can help you promote your app visit: https://sidequestvr.atlassian.net/l/c/3QLXTxbV \n To discuss any of these opportunities join the Dev Discord and dm @orlaharris - https://sdq.st/devdiscord  \n \n https://sdq.st/a/"}
]
