[
{"name" : "Submission New", "message":"Hi, thanks for starting a listing with us. I am here to help - just ask. When your listing is ready submit for approval. For more info on how to complete your listing see here: https://sdq.st/submit\n https://sdq.st/a/"},
{"name" : "Submission Approval No ", "message":"Hi, thanks for starting a listing with us. I am here to help- - just ask. You have submitted for approval however your listing is not ready just yet. For more info on how to complete your listing see here: https://sdq.st/submit  Submit for approval when ready.\n https://sdq.st/a/"},
{"name" : "Approval N", "message":"Hi, You have submitted for approval however your listing is not ready just yet. For more info on how to complete your listing see here: https://sdq.st/submit  Submit for approval when ready. \n https://sdq.st/a/"},
{"name" : "Submission Approval Y", "message":"Hi, thanks for listing with us.  I am here to help- just ask.  I have pre-approved your app. You are now in control and you can choose to publish, use the Early Access system or share privately using keys. Tag us @sidequestvr on Twitter and we will share any hype about your app. I recommend you also use #virtualreality #oculusquest in posts as bots retweet these. For more info see here: https://sdq.st/submit \n https://sdq.st/a/"},
{"name" : "Approval Y", "message":"Hi, I have pre-approved your app. You are now in control and you can choose to publish, use the Early Access system or keep private . For more info see here: https://sdq.st/submit \n https://sdq.st/a/"},
{"name" : "Dropbox DL1", "message":"Hi, One quick note before we can test, please change the end of the Dropbox link to dl=1 to make it a direct download. Once done, save the listing and re-submit for approval. For more info see here: https://sdq.st/submit"},
{"name" : "Dropbox Error", "message":"Hi, Unfortunately your Dropbox link is producing an error. Please check and update the link. Once you have changed the link, save the listing and submit for approval. For more info see here: https://sdq.st/submit"},
{"name" : "Google Drive", "message":"Hi, thanks for listing with us. Unfortunately we cannot integrate with Google Drive. There are some options available including Dropbox, Github & Glitch. Once you have changed the link, save the listing and submit for approval. For more info see here: https://sdq.st/submit"},
{"name" : "Unknown Drive", "message":"Hi, thanks for listing with us. Unfortunately we cannot integrate with the download link you have provided. There are some options available including Dropbox, Github & Glitch. Once you have changed the link, save the listing and submit for approval. For more info see here: https://sdq.st/submit"},
{"name" : "Approval Itch N", "message":"Hi, Thanks for listing with us. One quick note, please add the Itch URL under Donate URLS and remove from direct downloads. Once done, save the listing and submit for approval. If this is a paid game please also send a key so I can test the installation. More info here: https://sdq.st/submit \n https://sdq.st/a/"},
{"name" : "Itch Key", "message":"Hi, thanks for listing with us. As this is a paid app can you please share an Itch key and I will test the installation. Thanks."},
{"name" : "Free Banner N", "message":"Hi, I have received your request for a free feature. Presently, your listing does not have a suitable banner. Please follow the instruction here: https://sdq.st/submit  Once your listing is prepared please resubmit for a free banner. Note that if the banner is not suitable quality it will not be selected. Gifs are not permitted. Thanks"},
{"name" : "Itch Public", "message":"Hi, Quick note, it looks like your Itch page is private. Check these instructions to make your Itch page live: From the project's Edit page on ITCH, scroll to the Visibility & Access section located on the bottom and select the Public option. After saving your page, your project is published. Once you have completed this, submit for approval. Thanks"}
]
