[
{"name" : "Submission Approval No", "message":"Hi, thanks for starting a listing with us. I am here to help - just ask. You have submitted your listing for approval, however it is not ready just yet. Please add a download link - this can be your App Lab/Oculus link, Itch link or you can add a direct download link for your listing.  You can either add the APK file directly, under Download Urls, or you can host elsewhere - I recommend Github, however Dropbox will work if you change the end of the link to dl=1. For more info on how to complete your listing, please see here: https://sdq.st/submit.  Make sure to hit Save App, when you make any changes, and then re-submit for approval when ready. https://sdq.st/a/"},
{"name" : "Submission Approval Yes", "message":"Hi, good news - I have pre-approved your app. You are now in control and you can choose to publish, use the Early Access system or keep private. For more info on how we can help you promote your app visit: https://sdq.st/marketing.  This includes info on how to claim $100 free promo credit!  To discuss any of these opportunities join the Dev Discord and DM me @kelleymcdonald - https://sdq.st/devdiscord https://sdq.st/a/"},
{"name" : "Approval Yes Update", "message":"Hi, good news - I have pre-approved your app. You are now in control and you can choose to publish, use the Early Access system or keep private.  Can you please make sure your listing is fully updated with appropriate artwork and description, before you choose to publish.  This will ensure a better overall user experience. For more info on how we can help you promote your app visit: https://sdq.st/marketing. This includes info on how to claim $100 free promo credit! To discuss any of these opportunities join the Dev Discord and DM me @kelleymcdonald - https://sdq.st/devdiscord https://sdq.st/a/"},
{"name" : "Dropbox DL1", "message":"Hi, one quick note before we can test, please change the end of the Dropbox link to dl=1 to make it a direct download.  Update the link, hit Save App and re submit for approval when complete. For more info see here: https://sdq.st/submit https://sdq.st/a/"},
{"name" : "Dropbox Error", "message":"Hi, unfortunately your Dropbox link is producing an error. Please check and update the link.  When you have done so, please make sure to hit Save App and re submit for approval when complete. For more info see here: https://sdq.st/submit https://sdq.st/a/"},
{"name" : "Google Drive", "message":"Hi, thanks for starting a listing with us. Unfortunately we cannot integrate with Google Drive. I recommend you use Github, however Dropbox will work if you change the end of the link to dl=1.  Update the link, hit Save App and re submit for approval when complete. For more info see here: https://sdq.st/submit https://sdq.st/a/"},
{"name" : "Unknown Drive", "message":"Hi, thanks for starting a listing with us. Unfortunately we cannot integrate with the download link you have provided. I recommend you use Github, however Dropbox will work if you change the end of the link to dl=1.  Update the link, hit Save App and re submit for approval when complete. For more info see here: https://sdq.st/submit https://sdq.st/a/"},
{"name" : "Approval Itch N", "message":"Hi, Thanks for starting a listing with us. One quick note, please add the Itch URL under Donate Urls ( Including Itch.io ) and remove from Download Urls.  Update the link, hit Save App and re submit for approval when complete. If this is a paid game please also send an Itch key so I can test the installation. More info here: https://sdq.st/submit https://sdq.st/a/"},
{"name" : "Itch Key", "message":"Hi, thanks for starting a listing with us. As this is a paid app can you please share an Itch key and I will test the installation. Thanks. https://sdq.st/a/"},
{"name" : "Itch Public", "message":"Hi, one quick note, it looks like your Itch page is private. Check these instructions to make your Itch page live: From the project's Edit page on ITCH, scroll to the Visibility & Access section located on the bottom and select the Public option. After saving your page, your project is published. Once you have completed this, please make sure to hit Save App and re submit for approval. Thanks. https://sdq.st/a/"},
{"name" : "Claim An App", "message":"Hi, thanks for reaching out. In order to prove you are the developer, would you mind sending an email to kelley@side.quest - with a screen shot of the top of your Oculus Dashboard. We just need that to verify then we can transition the app to your account. Thanks!"},   
{"name" : "Unclaimed App", "message":"Hi There, it looks like the developer has not claimed this listing so they won't receive your messages.  You may be able to reach out to the developer in another way. Thanks"},   
{"name" : "Unclaimed App Lab", "message":"Hi There, it looks like the developer has not claimed this listing so they won't receive your messages. If they are on App Lab then they may have a website or social channel listed where you can reach out to them. Thanks"},
{"name" : "Broken Link", "message":"Hi, it looks like your link has stopped working / has been removed.  We have temporarily unapproved the listed. Please update the link, make sure to hit Save App when you have done so, and re submit for approval when ready so we can check and pre-approve. https://sdq.st/a/"},
{"name" : "Duplicate App Lab", "message":"Hi There, it looks like someone submitted your App Lab game to Sidequest but you also have an active listing.  We have unapproved the duplicate listing so you can now add your App Lab link to your current listing under the 'Integrations’ tab in 'Manage'. You can choose to remove your sideload link or keep it. For more info on how we can help you promote your app visit: https://sdq.st/marketing To discuss any of these opportunities join the Dev Discord and DM me @kelleymcdonald - https://sdq.st/devdiscord https://sdq.st/a/ "},  
{"name" : "App Transfer Complete", "message":"Hi There, I have now transferred the app to you. You are now in control and can choose to ‘Manage’ and update your listing. For more info on how we can help you promote your app visit:  https://sdq.st/marketing.  To discuss any of these opportunities join the Dev Discord and DM @kelleymcdonald - https://sdq.st/devdiscord https://sdq.st/a/"},
{"name" : "APK/OBB", "message":"Hi, thanks for starting a listing with us. I am here to help - just ask. To install APK/OBB files, please use GiHub Releases.  Check out this video for help https://www.youtube.com/watch?v=B0IZv-ljwSI. Alternatively you can use ITCH for APK/OBB - as long as the links are directly inside a ZIP folder (not file within a file).  When your listing is ready, please make sure to hit Save App and re-submit for approval. For more info on how to complete your listing see here: https://sdq.st/submit https://sdq.st/a/"},
{"name" : "Github Public", "message":"Hi, thanks for starting a listing with us. I am here to help - just ask. Please make sure your repository is public on Github, as this is causing a download error.  Make sure to hit Save App when you make any changes.  When your listing is ready, re-submit for approval. For more info on how to complete your listing see here: https://sdq.st/submit https://sdq.st/a/"},
{"name" : "Oculus Link", "message":"Hi, thanks for starting a listing with us. I am here to help - just ask. Your Oculus listing does not have a live download link yet,  this can result in negative reviews on SQ and increase support tickets reporting 'the problem'. As a result we can pre-approve your listing but we request you do not publish until your Oculus download link is live. For more info on how we can help you promote your app visit:  https://sdq.st/marketing.  This includes info on how to claim $100 free promo credit!  To discuss any of these opportunities join the Dev Discord and DM @kelleymcdonald - https://sdq.st/devdiscord https://sdq.st/a/"},
{"name" : "Claim Credit", "message":"Hi, we can get that sorted for you - join our developer discord and DM @kelleymcdonald - https://sdq.st/devdiscord"},
{"name" : "Name Match", "message":"Hi, thanks for starting a listing with us. I am here to help - just ask. One quick note - can you please make sure your listing name, package name and app name all match.  This will create a better overall user experience.  When your listing is ready make sure to hit Save App and re submit for approval. For more info on how to complete your listing see here: https://sdq.st/submit https://sdq.st/a/"}
]
