[
{"name" : "Submission New", "message":"Hi, thanks for starting a listing with us. I am here to help - just ask. When your listing is ready submit for approval. For more info on how to complete your listing see here: https://sdq.st/submit\n https://sdq.st/a/"},
{"name" : "Submission Approval No ", "message":"Hi, thanks for starting a listing with us. I am here to help- just ask. You have submitted for approval however your listing is not ready just yet. Please add a download link. I recommend Github however Dropbox will work if you change the end of the link to dl=1. For more info on how to complete your listing see here: https://sdq.st/submit  Submit for approval when ready.\n https://sdq.st/a/"},
{"name" : "Approval N", "message":"Hi, You have submitted for approval however your listing is not ready just yet. Please add a download link. I recommend Github however Dropbox will work if you change the end of the link to dl=1. Update the link, SAVE and submit for approval when complete. For more info on how to complete your listing see here: https://sdq.st/submit  \n https://sdq.st/a/"},
{"name" : "Submission Approval Y", "message":"Hi, thanks for listing with us.  I am here to help- just ask.  I have pre-approved your app. You are now in control and you can choose to publish, use the Early Access system or share privately using keys. If you plan to publish then tag any hype about your app @sidequestvr on Twitter and we will share. Also use #virtualreality #oculusquest in posts as bots retweet these. Check out our new Promotion system for Homepage Banners and Infill Ads - https://sdq.st/promote  \n https://sdq.st/a/"},
{"name" : "Approval Y", "message":"Hi, I have pre-approved your app. You are now in control and you can choose to publish, use the Early Access system or keep private. If you plan to publish then tag any hype about your app @sidequestvr on Twitter and we will share. Also use #virtualreality #oculusquest in posts as bots retweet these. Check out our new Promotion system for Homepage Banners and Infill Ads - https://sdq.st/promote \n https://sdq.st/a/"},
{"name" : "Dropbox DL1", "message":"Hi, One quick note before we can test, please change the end of the Dropbox link to dl=1 to make it a direct download.  Update the link, SAVE and submit for approval when complete. For more info see here: https://sdq.st/submit"},
{"name" : "Dropbox Error", "message":"Hi, Unfortunately your Dropbox link is producing an error. Please check and update the link.  Update the link, SAVE and submit for approval when complete.  For more info see here: https://sdq.st/submit"},
{"name" : "Google Drive", "message":"Hi, thanks for listing with us. Unfortunately we cannot integrate with Google Drive. I recommend Github however Dropbox will work if you change the end of the link to dl=1.  Update the link, SAVE and submit for approval when complete. For more info see here: https://sdq.st/submit"},
{"name" : "Unknown Drive", "message":"Hi, thanks for listing with us. Unfortunately we cannot integrate with the download link you have provided. I recommend Github however Dropbox will work if you change the end of the link to dl=1.  Update the link, SAVE and submit for approval when complete. For more info see here: https://sdq.st/submit"},
{"name" : "Approval Itch N", "message":"Hi, Thanks for listing with us. One quick note, please add the Itch URL under Donate URLS and remove from direct downloads.  Update the link, SAVE and submit for approval when complete.  If this is a paid game please also send a key so I can test the installation. More info here: https://sdq.st/submit \n https://sdq.st/a/"},
{"name" : "Itch Key", "message":"Hi, thanks for listing with us. As this is a paid app can you please share an Itch key and I will test the installation. Thanks."},
{"name" : "Free Banner N", "message":"Hi, I have received your request for a free feature. Presently, your listing does not have a suitable banner. Please follow the instructions here: https://sdq.st/submit  Once your listing is prepared please resubmit for a free banner. Note that if the banner is not suitable quality it will not be selected. Gifs are not permitted. Thanks"},
{"name" : "Itch Public", "message":"Hi, Quick note, it looks like your Itch page is private. Check these instructions to make your Itch page live: From the project's Edit page on ITCH, scroll to the Visibility & Access section located on the bottom and select the Public option. After saving your page, your project is published. Once you have completed this, submit for approval. Thanks"} 
{"name" : "Promote", "message":"Hi, You can find more info about our new Promotion system for Homepage Banners and Infill Ads here: https://sdq.st/promote  \n https://sdq.st/a/"}   
{"name" : "Free App Build Community", "message":"Hi, Just a quick note, I don't normally tell devs what to do with games sales because I definitely want you to be able to earn money, but after only a a few minutes of gameplay I think you have a nice game here and I want to see it succeed, so this is just a suggestion... paid games are much harder to sell at the very beginning, it can help to have the game free for a little bit, even just a few days, to build up some positive reviews, downloads and community support. The Hot and Fresh list works by downloads and reviews in a short period. The community get involved and it helps verify to people that the game is worth buying when you make it paid down the line. If you already have a Discord community waiting to buy it you may not be too concerned so it is totally up to you! I am here any time for a chat, we really want to help Developers build communitites around their apps and we love to hear ideas on how we can help. Thanks"}   
]
