[
{"name" : "Setup & Download", "message":"Hey there traveller! \n\nSorry you are having trouble, it can be frustrating when things dont work right. Try to follow the [setup steps](https://sdq.st/setup) again to make sure you have completed them all correctly. You may also find luck in this driver tutorial for windows users - https://sdq.st/drivers. Please note Windows 7, 8 and 11 are not supported, 32bit windows is not supported on any version and chromebooks are not supported."},
{"name" : "Not SideQuest Support", "message":"Hi traveller! \n\nSometimes games and apps on SideQuest are challenging, this can be for a few reasons. Either they are still in development or they may be aimed at more advanced users. It's best to reach out to the developer of the game directly to ask any game related questions, you can find links to social media and discord on their game page. If you are struggling with some technical process you can always ask a friend or family member for help. We want this support community to be used just for support related to SideQuest itself so we cant offer much more help at this stage im afraid. I hope you get sorted soon!"},
{"name" : "Oculus Support", "message":"Hey there! \n\nThanks for reaching out. On first look it seems that issue might be related to the service Oculus provides and not something we can help with directly. We will circle back with more info if we have it but in the mean time it might be worth reaching out to oculus support - https://oculus.com/support. God speed traveller!"},
{"name" : "No Mobile App APK Install", "message":"Hey there! \n\nI realise you want to be able to install APK files on the go but this feature was omitted on purpose. We dont want SideQuest to be used for piracy. This feature in our desktop app got abused pretty bad. We decided to omit this feature on our mobile app to avoid us enabling piracy on mobile with SideQuest. You can use our desktop app, or use an app caleld bugjaeger on android. Best of luck traveller!"},
{"name" : "No Piracy", "message":"Hello traveller! \n\nThanks for reaching out. On first look it seems that you might be trying to use SideQuest for piracy. We dont support that for obvious reasons. If you want free games we have tonnes of giveaways running all the time, check our twitter and discord for free stuff. Stay safe on your journey!"},
{"name" : "Enable USB Dialog", "message":"Hey there! \n\nThanks for reaching out. In the headset settings under System > Developer > Enable USB Dialog you can re-enable the USB dialog if it was accidentally dismissed. In some cases users have had to re-verify their developer account too ( by adding a credit card rather than a phone number ). In some cases toggling dev mode and factory resetting has also helped. These solutions may not be required but unfortunately Dev Mode and ADB can come with quirks sometimes but we have seen a lot of workarounds too. It might be worth reaching out to oculus support too - https://oculus.com/support. God speed traveller!"},
{"name" : "Premature end of stream, needed 1 more bytes", "message":"Hi traveller! \n\nThanks for reaching out. This can be caused by a few things. Most common is a USB connection problem. Try another USB cable or port if you can, avoid USB3 as it has known issues with ADB ( the underlying connection to your headset ). This can also be caused by a problem with a specific app on SideQuest, if it only happens with one app and not all. Let us know! Best of luck, brave traveller!"},
{"name" : "INSTALL_FAILED_INSUFFICIENT_STORAGE", "message":"Hey there! \n\nThis error - INSTALL_FAILED_INSUFFICIENT_STORAGE - measn your headset storage space is low. Try uninstalling some apps or games. God speed traveller!"},
{"name" : "INSTALL_FAILED_VERSION_DOWNGRADE", "message":"Hey there! \n\nThis error - INSTALL_FAILED_VERSION_DOWNGRADE - means the app you want to install is already installed and the installed version is newer than the one you want to install. To work around this uninstall the app first then try again. \n\nYou may need to uninstall it from all accounts on your headset. \n\nIt is recommended that you uninstall it from the desktop SideQuest app if you don't see it in unknown sources. You can do that in the my apps screen on the SideQuest app where you can find the app using its name or package name ( like net.kdt.pojavlaunch for QuestCraft ). Click the cog wheel icon then on uninstall. \n\nGod speed traveller!"},
{"name" : "Beat Saber Mods", "message":"Hey there! \n\nWe dont have the best advice for you on that but we can get you to the right place! Check out https://discord.gg/beatsabermods to get help and support there. God speed traveller!"},
{"name" : "Chromebook Support", "message":"Hey there! \n\nWe wish we could support chromebooks but its simply not possible - unfortunately its an issue on the chromebook end. God speed traveller!"},
{"name" : "Windows 11", "message":"Hey there! \n\nThis is a known isue. SideQuest actually supports Windows 11 mostly but the real issue is that the Windows 11 drivers have not been provided by Meta. You can request more from Oculus support over at https://oculus.com/support. \n\nGod speed traveller! "},
{"name" : "Oculus Support", "message":"Hey there! \n\nThanks for reaching out. On first look it seems that issue might be related to the service Oculus provides and not something we can help with directly. We will circle back with more info if we have it but in the mean time it might be worth reaching out to oculus support - https://oculus.com/support. God speed traveller!"},
{"name" : "Advanced Installer", "message" : "Hey there! \n\nThanks for reaching out. If you go to the download page and scroll down you will find the Advanced Installer, grab that instead.\n\nhttps://sdq.st/download\n\nGodspeed traveler!"}
]
