[
{
  "name" : "Connection Problems USB", 
  "message":"Hello!\n\nIt seems you're encountering some USB connection challenges. Let's tackle this step by step. First, I suggest experimenting with different USB cables if you have any spare ones around. Alternatively, borrowing a cable can be a quick way to test without immediately purchasing a new one. It's often surprising how frequently issues are due to a simple cable fault.\n\nAlso, try connecting to different USB ports on your device. Sometimes, certain ports don't work as well as others for various technical reasons. An additional tip: with USB Type-C connectors, flipping the connector 180 degrees can sometimes make a difference, so it's worth a try.\n\nIf you manage to establish a connection, even briefly, switching to 'Enable wireless mode' in the SideQuest app can be a great workaround. This wireless mode can save you from future USB hassles and streamline your VR experience.\n\nFor a more permanent solution, once you have a stable connection, consider using the easy installer to install SideQuest directly on your headset. This method can significantly simplify future interactions with SideQuest.\n\nRemember, these technical hiccups are just small bumps on the exciting road of VR exploration. Keep a positive attitude, and you'll overcome this in no time. We're here to support you every step of the way, so please don't hesitate to reach out if you have more questions or need further assistance.\n\nWishing you the best of luck and lots of fun in your VR adventures!"
},
{
  "name" : "Unknown Sources v55", 
  "message" : "Hey there!\n\nOn the home screen inside your headset, look for a button on the right with a 3x3 square grid. This is the 'App Library' button. Click it, then click on the search bar. A filter icon should show up next to the search box. Click this icon and at the bottom of the drop-down list that appears, pick 'Unknown Sources'.\n\nThis will let you see all the games you've installed from SideQuest. You can then pick a game and start playing!\n\nI hope this helps! Safe travels on your journey."
},
{
  "name" : "Not SideQuest Support", 
  "message":"Hello!\n\nNavigating the world of SideQuest games and apps can sometimes feel like a bit of a puzzle, especially since many of these are still in development or designed for more experienced users. If you find yourself stumped by a particular game, a great first step is to contact the game's developer directly. You can often find links to their social media and Discord channels on the game's SideQuest page, usually located on the right-hand side.\n\nIn case you're wrestling with a complex technical issue, remember that it's always okay to seek assistance from friends or family members who might be more familiar with these kinds of challenges. However, please keep in mind that our community here is primarily equipped to support SideQuest-specific queries. While our ability to assist with issues outside of that scope might be limited, we still hope you find the guidance you need.\n\nBest of luck on your SideQuest journey, and if there's anything SideQuest-related we can help you with, don't hesitate to reach out!\n\nSafe travels!"
},
{
  "name" : "Meta Support refer", 
  "message":"Hello!\n\nThanks for reaching out to us. It looks like the issue you're facing might be more directly connected to Meta's services. This means it falls a bit outside the range of issues we can address through SideQuest support.\n\nFor assistance tailored to your specific situation, I suggest contacting Meta Quest Support. They're the experts on issues directly related to Meta's services and products, so they're your best bet for a solution.\n\nWish you the best on your VR journey, and safe travels! Remember, if you have any SideQuest-related queries, we're more than happy to help you out."
},
{
  "name" : "Mobile app", 
  "message":"I'm sorry to hear you're having trouble connecting your phone to the SideQuest app. Let's try a few troubleshooting steps to remove the 'Important' toaster message.\n\n- Check Compatibility: Ensure that your phone is compatible with the SideQuest app. Not all phones support ADB over OTG, which is necessary for connecting to SideQuest.\n\n- Developer Mode: Make sure that Developer Mode is activated on your phone. This is essential for the SideQuest app to function correctly.\n\n- USB Debugging: On your phone, go to Settings > Developer Options and ensure that USB Debugging is turned on.\n\n- Reliable USB Cable: Use a high-quality USB cable to connect your phone to your PC or VR headset. Some cables are only capable of charging and don't support data transfer, which is needed for SideQuest.\n\n- Check USB Port: Try different USB ports on your PC or headset to rule out the possibility of a port issue.\n\n- Restart Devices: Sometimes, simply restarting both your phone and the other device (PC or VR headset) can resolve connectivity issues.\n\n- Update SideQuest: Ensure that you're using the latest version of the SideQuest app.\n\n- Security Settings: On Android phones, check your security settings to ensure they're not preventing the connection.\n\n- Try Wireless Mode: If the USB method is problematic, consider setting up a wireless connection via SideQuest. This can be a more stable method once established.\n\n- Consult Documentation: Refer to the SideQuest setup guide for detailed instructions: [SideQuest Setup Guide](https://sdq.st/download).\n\nIf you've tried these steps and are still facing issues, it could be helpful to provide more details about the specific problem you're encountering, such as any error messages or the model of your phone and VR headset. This information can be crucial in pinpointing the exact cause of the problem.\n\n You'll know when a connection is possible once you see a USB debugging RSA fingerprint, prompt"
},
{
  "name" : "Piracy", 
  "message":"Hello traveller! \n\nThank you for contacting us. It seems you might be trying to use SideQuest for piracy, which we firmly oppose. We host numerous giveaways if you're interested in free games—keep an eye on our Twitter and Discord for these opportunities.\n\nBest wishes for your adventure!"
},
{
  "name" : "Not Authorized", 
  "message":"Hello there,\n\nTry restarting your headset and switching dev mode off and on.\n\nA defective USB cable could be the culprit. Experiment with other cables you possess or borrow one before purchasing a new one. Try different USB ports and flip the Type-C end 180 degrees.\n\nRe-verifying their developer account (using a credit card instead of a phone number), toggling dev mode, and factory resetting have worked for some users.\n\nIf possible, use another PC or the SideQuest app from the Android play store for testing.\n\nRemember, [Meta Quest Support](https://www.meta.com/help/support/) is there to help.\n\nGodspeed!"
},
{
  "name" : "ScrCpy2 Audio routing", 
  "message":"Hello!\n\nRegarding your question about ScrCpy2 and its audio routing feature: ScrCpy2, which is commonly used for streaming, is set up to route audio by default. At present, there isn't a built-in option within the app to disable this feature. However, you can find detailed instructions on how to stop audio rerouting by visiting the ScrCpy2 GitHub page. They have a specific section dedicated to audio management, which should provide the guidance you need.\n\nYou can access this information directly through the following link: [ScrCpy2 Audio Management](https://github.com/Genymobile/scrcpy/blob/master/doc/audio.md). This page will give you a comprehensive overview and step-by-step instructions to customize the audio settings to your preference.\n\nIf you have any further questions or need more assistance, feel free to ask!"
},
{
  "name" : "Premature end of stream, needed 1 more bytes", 
  "message":"Hi traveller! \n\nThanks for reaching out. This problem can arise from several factors. A frequent cause is a USB connection issue. Try using a different USB cable or port if you can, and steer clear of USB3 because of its known ADB compatibility issues, which is the fundamental connection to your headset. The problem might also be tied to a specific app on SideQuest. Let us know if it's only happening with one app. Wishing you luck on your journey, brave traveler!"
},
{
  "name" : "INSTALL_FAILED_INSUFFICIENT_STORAGE", 
  "message":"Hey there! \n\nThis error - INSTALL_FAILED_INSUFFICIENT_STORAGE - means your headset storage space is low. Try uninstalling some apps or games. God speed traveller!"
},
{
  "name" : "INSTALL_FAILED_VERSION_DOWNGRADE", 
  "message":"Hey there! \n\nThe error you're encountering—INSTALL_FAILED_VERSION_DOWNGRADE—indicates that the app you're attempting to install already exists on your device, and the installed version is newer. To resolve this, you'll need to uninstall the current app before attempting reinstallation.\n\nRemember to uninstall the app from all accounts on your headset.\n\nIf you can't locate the app in 'Unknown Sources', it's suggested to uninstall it from the desktop SideQuest app. Navigate to the 'My Apps' screen on SideQuest, locate the app using its name or package name (e.g., net.kdt.pojavlaunch for QuestCraft), click on the cogwheel icon, and then select 'Uninstall'. \n\nGod speed traveller!"
},
{
  "name" : "QuestCraft Issues", 
  "message":"Hey there! \n\nWhile we might not have the ideal advice for you on this matter, we can certainly guide you to the right resource! For assistance and support, consider visiting [Quest Craft Discord](https://discord.gg/questcraft). Godspeed traveller!"
},
{
  "name" : "Beat Saber Mods", 
  "message":"Hey there! \n\nWhile we might not have the ideal advice for you on this matter, we can certainly guide you to the right resource! For assistance and support, consider visiting [Beat Saber Mods Discord](https://discord.gg/beatsabermods). Godspeed traveller!"
},
{
  "name" : "Chromebook Support", 
  "message":"Hey there! \n\nWe wish we could support Chromebooks but it's simply not possible - unfortunately it's an issue on the Chromebook end. God speed traveller!"
},
{
  "name" : "Linux Support", 
  "message":"Hey!\n\nSupport for Linux is somewhat limited due to the vast number of distributions and occasional need for additional software or configuration.\n\nTypically, you can extract the tarball and run either `./sidequest` or `./sidequestlite`, depending on your version. The app, built on Electron, is open-source—Linux users can compile it from the source available at [SideQuest's GitHub repository](https://github.com/SideQuestVR/SideQuest).\n\nI hope this information proves helpful!"
},
{
  "name" : "Screen copy Mac", 
  "message" : "Hey there!\n\nSideQuest utilizes a software called scrcpy (Screen Copy) for streaming. While not included in the Mac version of SideQuest due to various reasons, it's still possible to use scrcpy on Mac. Check out [guiscrcpy](https://guiscrcpy.srev.in/), a free software that leverages scrcpy and supports Mac. \n\nBest of luck traveller!"
},
{
  "name" : "Advanced Installer", 
  "message" : "Hey there! \n\nThanks for reaching out. If you go to the download page and you will find the Advanced Installer on the right, grab that instead.\n\nhttps://sdq.st/download\n\nGodspeed traveller!"
},
{
  "name" : "Connecting...", 
  "message" : "Hey there! \n\nThanks for reaching out. This issue arises when something hinders ADB from running. Attempt uninstalling SideQuest, and when prompted to remove app data, select 'yes'. Then, install the latest version from [here](https://sdq.st/download)—scroll down for the Advanced Installer.\n\nIf you continue to face issues, your antivirus might be blocking ADB. Check its Vault, Quarantine, or similar sections for an entry named 'ADB.exe' and remove it. Temporarily disabling your antivirus can also help identify if it's causing the issue.\n\nShould the problem persist, consider trying on a different computer or using our Android app on Google Play. \n\nGodspeed traveller!"
},
{
  "name" : "Downloading...", 
  "message" : "Hello!\n\nIt looks like you encountered an issue where your download got interrupted, possibly due to a temporary disconnection of the USB cable. This can sometimes cause downloads to get stuck or freeze.\n\nTo resolve this, I'd recommend first reconnecting your Quest to SideQuest using the USB cable. Once you've re-established the connection, a good next step is to switch over to Wi-Fi mode. This can help prevent similar issues in the future by reducing reliance on the physical USB connection.\n\nAlternatively, for an even smoother experience, you might want to use the 'Easy installer'. This tool, available on the PC, allows you to install SideQuest directly onto your headset with minimal hassle. If you're using the mobile app, you can find this option by tapping the three dots in the bottom right corner, going to tools, and selecting 'Install SideQuest into your headset' at the top of the menu.\n\nFor a more detailed guide on setting this up, you can visit the following link: SideQuest Setup Guide.\n\nI hope this helps! Wishing you the best on your VR adventures. If you have any more questions or run into further issues, don't hesitate to reach out. Happy travels!"
},
{
  "name" : "I'll try to replicate that", 
  "message" : "Hello there,\n\nI'm going to see if I can test that and reproduce it on my end. If I can't then we'll keep an eye out for more reports.\n\nBe back soon traveller!"
},
{
  "name" : "Couldn't replicate (I'll try to replicate that optional PART 2)", 
  "message" : "Okay, so I've run some tests and couldn't replicate the issue you're having.\n\nTry restarting your Quest or even factory resetting it.\n\nWe'll keep an eye on it but we've had no other reports of this happening so far.\n\nBest of luck on your journey traveller!"
},
{
  "name" : "BONELAB mod)", 
  "message" : "Hello there, If you would like access to the full mod list for BONELAB from inside the headset, SideQuest now lets you have access to that with one click.\n\nInside either version of SideQuest on PC, go to the tools page and scroll down to a button saying ‘ENABLE BONELAB MODS’ and click it!\n\n![](https://i.ibb.co/VtbzPWX/Side-Quest-vt65o-VWOYc.png)\n\nOnce you’ve done that, open BONELAB then from the main menu go to Mods then External.\n\nEnjoy!"
},
{
  "name" : "Parsing issue", 
  "message":"Hello there,\n\nIf you've updated your Quest, the game might not be compatible with the new API implemented by Meta—this requires the game developer to release an update. Alternatively, if your Quest OS is older and the game has been updated to the new API, you'll need to update your Quest."
}
]
