[
{
  "name" : "USB Problems", 
  "message":"Hello there,\n\nSounds like you may have a faulty USB cable. Try a few spare cables you may have or if possible, borrow one just to be sure before potentially buying a new one. Also try using different USB ports as well as flipping the type C end around 180 degrees.\n\nIf you’re able to get a USB connected even for just a moment, use the ‘Enable wireless mode’ in the SideQuest app.\n\nI would recommend using the easy installer next time you find a working cable and put Sidequest straight onto the headset.\n\nI hope this sorts your problem out. Let us know if it works for you!\n\nGood luck traveler!"
},
{
  "name" : "Not SideQuest Support", 
  "message":"Hi traveller! \n\nSometimes games and apps on SideQuest are challenging, this can be for a few reasons. Either they are still in development or they may be aimed at more advanced users. It's best to reach out to the developer of the game directly to ask any game related questions, you can find links to social media and discord on their game page on the right. If you are struggling with some technical process you can always ask a friend or family member for help. We want this support community to be used just for support related to SideQuest itself so we cant offer much more help at this stage im afraid. I hope you get sorted soon!"
},
{
  "name" : "Oculus Support", 
  "message":"Hey there! \n\nThanks for reaching out. On first look it seems that issue might be related to the service Oculus provides and not something we can help with directly. We will circle back with more info if we have it but in the mean time it might be worth reaching out to oculus support - https://oculus.com/support. God speed traveller!"
},
{
  "name" : "No Mobile App APK Install", 
  "message":"Hey there!\n\nI realise you want to be able to install APK files on the go but this feature was omitted on purpose. We dont want SideQuest to be used for piracy. This feature in our desktop app got abused pretty bad. We decided to omit this feature on our mobile app to avoid us enabling piracy on mobile with SideQuest. You can use our desktop app, or use an app caleld bugjaeger on android. Best of luck traveller!"
},
{
  "name" : "No Piracy", 
  "message":"Hello traveller! \n\nThanks for reaching out. On first look it seems that you might be trying to use SideQuest for piracy. We dont support that for obvious reasons. If you want free games we have tonnes of giveaways running all the time, check our twitter and discord for free stuff. Stay safe on your journey!"
},
{
  "name" : "Not Authorized", 
  "message":"Hello there,\n\nIt might be worth restarting your headset, also disabling and re-enabling dev mode.\n\nYou may also have a faulty USB cable. Try a few spare cables you may have or if possible, borrow one just to be sure before potentially buying a new one. Also try using different USB ports as well as flipping the type C end around 180 degrees.\n\nIn some cases users have had to re-verify their developer account too ( by adding a credit card rather than a phone number ). In some cases toggling dev mode and factory resetting has also helped.\n\nIf possible, try using another PC from a friend or family member too and try the SideQuest app from the play store on Android.\n\nIt might be worth reaching out to oculus support too - https://oculus.com/support. Godspeed traveler!"
},
{
  "name" : "Premature end of stream, needed 1 more bytes", 
  "message":"Hi traveller! \n\nThanks for reaching out. This can be caused by a few things. Most common is a USB connection problem. Try another USB cable or port if you can, avoid USB3 as it has known issues with ADB ( the underlying connection to your headset ). This can also be caused by a problem with a specific app on SideQuest, if it only happens with one app and not all. Let us know! Best of luck, brave traveller!"
},
{
  "name" : "INSTALL_FAILED_INSUFFICIENT_STORAGE", 
  "message":"Hey there! \n\nThis error - INSTALL_FAILED_INSUFFICIENT_STORAGE - means your headset storage space is low. Try uninstalling some apps or games. God speed traveller!"
},
{
  "name" : "INSTALL_FAILED_VERSION_DOWNGRADE", 
  "message":"Hey there! \n\nThis error - INSTALL_FAILED_VERSION_DOWNGRADE - means the app you want to install is already installed and the installed version is newer than the one you want to install. To work around this uninstall the app first then try again. \n\nYou may need to uninstall it from all accounts on your headset. \n\nIt is recommended that you uninstall it from the desktop SideQuest app if you don't see it in unknown sources. You can do that in the my apps screen on the SideQuest app where you can find the app using its name or package name ( like net.kdt.pojavlaunch for QuestCraft ). Click the cog wheel icon then on uninstall. \n\nGod speed traveller!"
},
{
  "name" : "Beat Saber Mods", 
  "message":"Hey there! \n\nWe don't have the best advice for you on that but we can get you to the right place! Check out https://discord.gg/beatsabermods to get help and support there. God speed traveller!"
},
{
  "name" : "Chromebook Support", 
  "message":"Hey there! \n\nWe wish we could support chromebooks but it's simply not possible - unfortunately it's an issue on the chromebook end. God speed traveller!"
},
{
  "name" : "Advanced Installer", 
  "message" : "Hey there! \n\nThanks for reaching out. If you go to the download page and you will find the Advanced Installer on the right, grab that instead.\n\nhttps://sdq.st/download\n\nGodspeed traveler!"
},
{
  "name" : "Connecting...", 
  "message" : "Hey there! \n\nThanks for reaching out. This problem is caused by something preventing ADB from running. Try uninstalling SideQuest and when it asks to remove app data select yes. Then install the latest version from [here](https://sdq.st/download) ( scroll down for the Advanced Installer ). If you are still having problems there are some other things to check, your antivirus might be blocking things. Check if it has a Vault or Quarantine or similar and look for an entry called ADB.exe and remove it. You can also disable your antivirus temporarily to see if the problem is resolved. If you still have issues then you might want to try another computer or try our Android app on Google play. \n\nGodspeed traveler!"
},
{
  "name" : "Couldn't replicate (I'll try to replicate that optional PART 2)", 
  "message" : "Okay, so I've run some tests and couldn't replicate the issue you're having.\n\nTry restarting your Quest or even factory resetting it.\n\nWe'll keep an eye on it but we've had no other reports of this happening so far.\n\nBest of luck on your journey traveller!"
},
{
  "name" : "I'll try to replicate that", 
  "message" : "Hello there,\n\nI'm going to see if I can test that and reproduce it on my end. If I can't then we'll keep an eye out for more reports.\n\nBe back soon traveller!"
}
]
